From: Michal Koutný <mkoutny@suse.com>
Date: Tue, 10 Mar 2026 15:30:48 +0100
Subject: kabi: cgroup.stat fixup
Patch-mainline: Never, kabi workaround
References: bsc#1256564 bsc#1259130

The upstream commit ab03125268679 ("cgroup: Show # of subsystem CSSes in
cgroup.stat") adds new counters both to struct cgroup_subsys_state and struct
cgroup. The former has a hole exactly for those 4B and the latter can be
expanded at the end (with the provisions for flex array at the end, already
brought in patches.kabi/kabi-add-struct-cgroup_extra.patch)

struct cgroup_subsys_state {
	struct cgroup *            cgroup;               /*     0     8 */
	struct cgroup_subsys *     ss;                   /*     8     8 */
	struct percpu_ref          refcnt;               /*    16    16 */
	struct list_head           sibling;              /*    32    16 */
	struct list_head           children;             /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct list_head           rstat_css_node;       /*    64    16 */
	int                        id;                   /*    80     4 */
	unsigned int               flags;                /*    84     4 */
	u64                        serial_nr;            /*    88     8 */
	atomic_t                   online_cnt;           /*    96     4 */

	/* XXX 4 bytes hole, try to pack */

	struct work_struct         destroy_work;         /*   104    32 */
	/* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
	struct rcu_work            destroy_rwork;        /*   136    56 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	struct cgroup_subsys_state * parent;             /*   192     8 */

	/* size: 200, cachelines: 4, members: 13 */
	/* sum members: 196, holes: 1, sum holes: 4 */
	/* last cacheline: 8 bytes */
};

Signed-off-by: Michal Koutný <mkoutny@suse.com>
Reviewed-by: Petr Pavlu <petr.pavlu@suse.com>
---
 include/linux/cgroup-defs.h |   77 +++++++++++++++++++++++++++++++++++++-------
 kernel/cgroup/cgroup.c      |   10 ++---
 2 files changed, 71 insertions(+), 16 deletions(-)

--- a/include/linux/cgroup-defs.h
+++ b/include/linux/cgroup-defs.h
@@ -191,6 +191,16 @@ struct cgroup_subsys_state {
 	 */
 	atomic_t online_cnt;
 
+#ifndef __GENKSYMS__
+	/*
+	 * Keep track of total numbers of visible descendant CSSes.
+	 * The total number of dying CSSes is tracked in
+	 * css->cgroup->nr_dying_subsys[ssid].
+	 * Protected by cgroup_mutex.
+	 */
+	int nr_descendants;
+#endif
+
 	/* percpu_ref killing and RCU release */
 	struct work_struct destroy_work;
 	struct rcu_work destroy_rwork;
@@ -200,16 +210,61 @@ struct cgroup_subsys_state {
 	 * fields of the containing structure.
 	 */
 	struct cgroup_subsys_state *parent;
+};
+
+struct __orig_cgroup_subsys_state {
+	/* PI: the cgroup that this css is attached to */
+	struct cgroup *cgroup;
+
+	/* PI: the cgroup subsystem that this css is attached to */
+	struct cgroup_subsys *ss;
+
+	/* reference count - access via css_[try]get() and css_put() */
+	struct percpu_ref refcnt;
+
+	/* siblings list anchored at the parent's ->children */
+	struct list_head sibling;
+	struct list_head children;
+
+	/* flush target list anchored at cgrp->rstat_css_list */
+	struct list_head rstat_css_node;
 
 	/*
-	 * Keep track of total numbers of visible descendant CSSes.
-	 * The total number of dying CSSes is tracked in
-	 * css->cgroup->nr_dying_subsys[ssid].
-	 * Protected by cgroup_mutex.
+	 * PI: Subsys-unique ID.  0 is unused and root is always 1.  The
+	 * matching css can be looked up using css_from_id().
 	 */
-	int nr_descendants;
+	int id;
+
+	unsigned int flags;
+
+	/*
+	 * Monotonically increasing unique serial number which defines a
+	 * uniform order among all csses.  It's guaranteed that all
+	 * ->children lists are in the ascending order of ->serial_nr and
+	 * used to allow interrupting and resuming iterations.
+	 */
+	u64 serial_nr;
+
+	/*
+	 * Incremented by online self and children.  Used to guarantee that
+	 * parents are not offlined before their children.
+	 */
+	atomic_t online_cnt;
+
+	/* percpu_ref killing and RCU release */
+	struct work_struct destroy_work;
+	struct rcu_work destroy_rwork;
+
+	/*
+	 * PI: the parent css.	Placed here for cache proximity to following
+	 * fields of the containing structure.
+	 */
+	struct cgroup_subsys_state *parent;
 };
 
+suse_kabi_static_assert(offsetof(struct cgroup_subsys_state, destroy_work) ==
+			offsetof(struct __orig_cgroup_subsys_state, destroy_work));
+
 /*
  * A css_set is a structure holding pointers to a set of
  * cgroup_subsys_state objects. This saves space in the task struct
@@ -459,12 +514,6 @@ struct cgroup {
 	/* Private pointers for each registered subsystem */
 	struct cgroup_subsys_state __rcu *subsys[CGROUP_SUBSYS_COUNT];
 
-	/*
-	 * Keep track of total number of dying CSSes at and below this cgroup.
-	 * Protected by cgroup_mutex.
-	 */
-	int nr_dying_subsys[CGROUP_SUBSYS_COUNT];
-
 	struct cgroup_root *root;
 
 	/*
@@ -548,6 +597,12 @@ struct cgroup_extra {
 	 * cgroup_rstat_flush_locked() and protected by cgroup_rstat_lock.
 	 */
 	struct cgroup	*rstat_flush_next;
+
+	/*
+	 * Keep track of total number of dying CSSes at and below this cgroup.
+	 * Protected by cgroup_mutex.
+	 */
+	int nr_dying_subsys[CGROUP_SUBSYS_COUNT];
 };
 
 /*
--- a/kernel/cgroup/cgroup.c
+++ b/kernel/cgroup/cgroup.c
@@ -3742,7 +3742,7 @@ static int cgroup_stat_show(struct seq_f
 		    (cgroup_subsys[ssid]->root !=  &cgrp_dfl_root))
 			continue;
 		css = rcu_dereference_raw(cgroup->subsys[ssid]);
-		dying_cnt[ssid] = cgroup->nr_dying_subsys[ssid];
+		dying_cnt[ssid] = cgroup_extra(cgroup)->nr_dying_subsys[ssid];
 		seq_printf(seq, "nr_subsys_%s %d\n", cgroup_subsys[ssid]->name,
 			   css ? (css->nr_descendants + 1) : 0);
 	}
@@ -5510,7 +5510,7 @@ static void css_release_work_fn(struct w
 		if (ss->css_released)
 			ss->css_released(css);
 
-		cgrp->nr_dying_subsys[ss->id]--;
+		cgroup_extra(cgrp)->nr_dying_subsys[ss->id]--;
 		/*
 		 * When a css is released and ready to be freed, its
 		 * nr_descendants must be zero. However, the corresponding
@@ -5521,7 +5521,7 @@ static void css_release_work_fn(struct w
 		WARN_ON_ONCE(css->nr_descendants);
 		parent_cgrp = cgroup_parent(cgrp);
 		while (parent_cgrp) {
-			parent_cgrp->nr_dying_subsys[ss->id]--;
+			cgroup_extra(parent_cgrp)->nr_dying_subsys[ss->id]--;
 			parent_cgrp = cgroup_parent(parent_cgrp);
 		}
 	} else {
@@ -5635,14 +5635,14 @@ static void offline_css(struct cgroup_su
 
 	wake_up_all(&css->cgroup->offline_waitq);
 
-	css->cgroup->nr_dying_subsys[ss->id]++;
+	cgroup_extra(css->cgroup)->nr_dying_subsys[ss->id]++;
 	/*
 	 * Parent css and cgroup cannot be freed until after the freeing
 	 * of child css, see css_free_rwork_fn().
 	 */
 	while ((css = css->parent)) {
 		css->nr_descendants--;
-		css->cgroup->nr_dying_subsys[ss->id]++;
+		cgroup_extra(css->cgroup)->nr_dying_subsys[ss->id]++;
 	}
 }
 
