From 49e708f58e3e11075ac5afbca0ebe875aacf3ab2 Mon Sep 17 00:00:00 2001
From: David Disseldorp <ddiss@suse.de>
Date: Wed, 17 Sep 2025 07:05:55 +0200
Subject: [PATCH 2/2] kABI: netfs: handle new netfs_io_stream flag
References: bsc#1249314 CVE-2025-39723
Patch-mainline: Never, kABI fix

pahole indicates that the new transferred_valid bool can be safely
packed in the existing padding the end of the struct:

struct netfs_io_stream {
...
	/* --- cacheline 1 boundary (64 bytes) --- */
	struct netfs_io_subrequest * front;              /*    64     8 */
	long long unsigned int     collected_to;         /*    72     8 */
	size_t                     transferred;          /*    80     8 */
	enum netfs_io_source       source;               /*    88     1 */

	/* XXX 1 byte hole, try to pack */

	short unsigned int         error;                /*    90     2 */
	unsigned char              stream_nr;            /*    92     1 */
	bool                       avail;                /*    93     1 */
	bool                       active;               /*    94     1 */
	bool                       need_retry;           /*    95     1 */
	bool                       failed;               /*    96     1 */

	/* size: 104, cachelines: 2, members: 19 */
	/* sum members: 96, holes: 1, sum holes: 1 */
	/* padding: 7 */
	/* last cacheline: 40 bytes */

Signed-off-by: David Disseldorp <ddiss@suse.de>
Reviewed-by: Takashi Iwai <tiwai@suse.de>
---
 include/linux/netfs.h | 2 ++
 1 file changed, 2 insertions(+)

diff --git a/include/linux/netfs.h b/include/linux/netfs.h
index 83d313718cd50..01974ac195f4d 100644
--- a/include/linux/netfs.h
+++ b/include/linux/netfs.h
@@ -150,7 +150,9 @@ struct netfs_io_stream {
 	bool			active;		/* T if stream is active */
 	bool			need_retry;	/* T if this stream needs retrying */
 	bool			failed;		/* T if this stream failed */
+#ifndef __GENKSYMS__
 	bool			transferred_valid; /* T is ->transferred is valid */
+#endif
 };
 
 /*
-- 
2.51.0

